{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Is anyone there?",
                "Hello",
                "Hey there",
                "hiiiiii",
                "hellloooo"
            ],
            "responses": [
                "Hello, I am Taleant AI, what can I help you with?"
            ],
            "context_set": ""
        },
        {
            "tag": "bye",
            "patterns": [
                "Goodbye",
                "bye",
                "tata",
                "see you",
                "talk to you later"
            ],
            "responses": [
                "Talk to you later",
                "Goodbye!"
            ],
            "context_set": ""
        },
        {
            "tag": "thank",
            "patterns": [
                "thanks",
                "thank you",
                "thanx"
            ],
            "responses": [
                "You're welcome"
            ],
            "context_set": ""
        },
        {
            "tag": "correct thank",
            "patterns": [
                "that is correct",
                "you are right",
                "nice to meet you",
                "it was nice talking with you",
                "you are great",
                "you are smart",
                "I like you",
                "it was helpful",
                "you are helpful"
            ],
            "responses": [
                "I am glad to hear that, thanks."
            ],
            "context_set": ""
        },
        {
            "tag": "introduction",
            "patterns": [
                "What is your name?",
                "what should I call you",
                "whats your name?",
                "who are you?",
                "Are you human?",
                "tell me about yourself",
                "are you real?",
                "are you smart?",
                "are you ai?"
            ],
            "responses": [
                "I am Taleant AI, a virtual assistant to answer your questions about anything related to Teleaus."
            ],
            "context_set": ""
        },
        {
            "tag": "bot role",
            "patterns": [
                "What do you know?",
                "What can you help me with?",
                "What is your role?",
                "what is your job?",
                "what can you do for me?"
            ],
            "responses": [
                "I shall try my best to answer any question, related to Teleaus."
            ],
            "context_set": ""
        },
        {
            "tag": "bot dumb",
            "patterns": [
                "You are not helpful",
                "You are wrong",
                "That is not correct",
                "you are dumb",
                "connect to me a person",
                "connect me to support team",
                "i want to talk to a person",
                "you are silly",
                "you sound funny"
            ],
            "responses": [
                "I cannot yet answer some questions correctly. Sorry for that. You can always forward your enquiry towards our <a href=\"https://teleaus.com/enquiry\" target=\"_blank\">Support Team</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "what Teleaus",
            "patterns": [
                "WHAT IS Teleaus?",
                "Tell me about Teleaus",
                "what can you tell me about Teleaus?",
                "I want to know about your company",
                "who are teleaus?"
            ],
            "responses": [
                "Teleaus is a global enterprise founded in 2011, headquartered in Australia. Teleaus is a leading information and communications engineering solutions and services provider specializing in IT services, telecommunications engineering and business solutions that deliver real results to businesses. As a global enterprise our mission is to build successful long-term win-win business relationships with clients."
            ],
            "context_set": ""
        },
        {
            "tag": "customer",
            "patterns": [
                "WHO ARE THE Teleaus CUSTOMERS?",
                "who are customers of Teleaus?",
                "who are their customers?"
            ],
            "responses": [
                "Teleaus is a single platform for online jobs, experts, training and networking solution. So, our customers are Expert professionals, Business users or clients, and trainees. Experts can search ICT jobs posted by Business users. Moreover, various types of skill development training are available in this platform too."
            ],
            "context_set": ""
        },
        {
            "tag": "global",
            "patterns": [
                "IS Teleaus IS A GLOBAL COMPANY?",
                "is Teleaus an international company?"
            ],
            "responses": [
                "Yes, this is a global platform. At present, Teleaus office is located in Australia, Bangladesh and Canada. Teleaus is working to increase footprint globally."
            ],
            "context_set": ""
        },
        {
            "tag": "values",
            "patterns": [
                "WHAT VALUE PROPOSITION Teleaus HAVE?",
                "WHAT VALUES Teleaus DELIVER?",
                "what are Teleaus values?",
                "what are the values of Teleaus?"
            ],
            "responses": [
                "Reliability: Be honest and reliable. Innovative: Innovate to make thing simple and collaborate to bring ideas to life. Excellence: Recognize and reward high performance. Leadership: Show personal drive - engage with and motivate others. Learning and sharing: Be open to share and different ways of doing things"
            ],
            "context_set": ""
        },
        {
            "tag": "services",
            "patterns": [
                "WHAT ARE THE CORE SERVICES Teleaus DELIVER?",
                "what are Teleaus services?",
                "what are the services of Teleaus?",
                "what services do you provide?",
                "WHAT DOES Teleaus OFFER?",
                "what are the benefits of using Teleaus?",
                "why should i use Teleaus?",
                "why would i become a Teleaus user?",
                "what can i do on Teleaus?"
            ],
            "responses": [
                "We offer Engineering Field Services, Telecommunications Engineering, business solutions and services including Engineering Project Consultancy, Complete Business Solutions, business software development, Spatial Data Engineering, Geospatial Engineering, Professional Services, Vendor Partnership, Business Process Outsources (BPO) through its unique delivery model for clients."
            ],
            "context_set": ""
        },
        {
            "tag": "vision",
            "patterns": [
                "WHAT IS THE VISION OF COMPANY?",
                "what is their vision?"
            ],
            "responses": [
                "To be the most innovative global enterprise that creates technology solutions and services to connect people."
            ],
            "context_set": ""
        },
        {
            "tag": "mission",
            "patterns": [
                "WHAT IS THE MISSION OF COMPANY?",
                "what is their mission?"
            ],
            "responses": [
                "To help customers to achieve their business objectives by providing innovative, best-in-class IT services, telecommunications consulting and business solutions. To make it a pleasure for all stakeholders to work with us. To build successful long-term win-win business relationships"
            ],
            "context_set": ""
        },
        {
            "tag": "ceo",
            "patterns": [
                "Who is the ceo of the company?",
                "Who is the boss of this company?",
                "What is the background of the ceo?",
                "Tell me about the CEO of Teleaus and Teleaus",
                "who is your boss?",
                "who founded Teleaus?"
            ],
            "responses": [
                "The CEO of Teleaus is Mr. Zahangir Alam. He founded Teleaus in 2011. His specialties are: Project Management, PRINCE2®, ITIL®, COBIT5® PNI Data, Data Managment, SpatialNet information management, Business Cost Analysis (TCO)"
            ],
            "context_set": ""
        },
        {
            "tag": "Teleaus founded",
            "patterns": [
                "when was it established?",
                "when was Teleaus founded?"
            ],
            "responses": [
                "It was founded in the year of 2011."
            ],
            "context_set": ""
        },
        {
            "tag": "Teleaus headquarter",
            "patterns": [
                "where is the headquarter?",
                "where is it based?",
                "where is the head office of Teleaus?",
                "where is it located?",
                "where is the location of the office?"
            ],
            "responses": [
                "Teleaus headquarter is based in Sydney, Australia. The address is: 1/1C Homebush Bay Dr, Rhodes NSW 2138."
            ],
            "context_set": ""
        },
        {
            "tag": "Teleaus career",
            "patterns": [
                "I want to work for Teleaus",
                "Can i be an employee of Teleaus?",
                "how can i join Teleaus team?",
                "what are the career opportunities at Teleaus?"
            ],
            "responses": [
                "Go to our Careers portal, and you can find current available job opportunities at Teleaus there. You can also learn about our team roles and life at Teleaus."
            ],
            "context_set": ""
        },
        {
            "tag": "service portfolio",
            "patterns": [
                "Can you give a service portfolio of this company?",
                "does teleaus have a service portfolio?",
                "what is the service portfolio of teleaus?"
            ],
            "responses": [
                "ENGINEERING: Field Services: Network Survey, Installation and Construction, Testing, Field Validation, Commissioning and System Integration. Broadband Engineering: Land Access, Broadband Network Planning & Designing, Geospatial Engineering Services, Telecommunications System Planning & Designing. Operations & Maintenance: We’ll work with you to drive enhanced operational efficiency, network quality and asset utilization across your network operations, maintaining the highest compliance to OHS practices at all times. CONSULTANCY: Consultancy Services: Engineering Project Management, Communications Engineering Consultancy Services, Spatial Data Engineering, Geospatial Engineering, Professional Services, Vendor Partnership, Business, Process Outsources (BPO). GEOSPATIAL: GIS & Spatial Engineering: Plan, Design and Manage Network Infrastructure Assets including Spatial Modeling and Spatial Data Engineering. WEB SERVICES: Web and Cloud Services: In today's demanding business environment which prioritizes flexibility, speed, and efficiency, a robust IT strategy is critical. We help our clients to achieve these qualities in IT strategy by providing system integration, testing, application development, and management services and solutions. VENDOR PARTNERSHIPS: A partnership is our ongoing and continuous process for expanding business scopes around the globe. We rely heavily on partners to lead customers to the New Style of Business. TRAINING PROGRAMS: As a part of the continuous development of ICT industry experts, Teleaus conducts various exclusive and comprehensive hands-on professional developments training and workshops for building expert resources fit for telecom industry."
            ],
            "context_set": ""
        },
        {
            "tag": "planning and designing",
            "patterns": [
                "Tell me about their network planning and designing services",
                "what are their planning and designing services?",
                "Do they offer network planning and desigining services?"
            ],
            "responses": [
                "Our Geospatial engineering team is highly capable in Spatial OSP, ISP modelling and producing high quality Construction, As-built documentation. We are comfortable working in complex technical. You can get more information about it <a href=\"https://teleaus.com/services?slug=network-planning\" target=\"_blank\">here</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "field services",
            "patterns": [
                "what field services do teleaus offer?",
                "what are the teleaus field services?",
                "tell me about teleaus field services"
            ],
            "responses": [
                "TELEAUS Field Engineering Services bring together specialists in Network Survey, Activation, Network Commissioning & Integration and Troubleshooting in FTTx, HFC Wireless and Mobile network domain. You can get more information about it <a href=\"https://teleaus.com/services?slug=field-services\" target=\"_blank\">here</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "network construction",
            "patterns": [
                "Do they do network construction?",
                "what are their network construction service?"
            ],
            "responses": [
                "We have end to end construction experience in FTTP, FTTC, FTTN and HFC network construction. Our skilled resources are continuously constructing street networks plus internal installations in SDUs & MDUs. You can get more information about it <a href=\"https://teleaus.com/services?slug=network-construction\" target=\"_blank\">here</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "consultancy and training",
            "patterns": [
                "What are their consultancy and training program?",
                "do teleaus offer consultancy and training services?"
            ],
            "responses": [
                "We offer support & consultation for a range of telecom network design/planning tools including PNI, Mentum Ellipse, Pathloss, Mapinfo, SpatialNet. Processing, analysing & cleaning GIS data on spatialNET. You can get more information about it <a href=\"https://taleant.com/\" target=\"_blank\">here</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "web services",
            "patterns": [
                "Does teleaus provide web services?",
                "what web services are offered by teleaus?",
                "what are the web services?"
            ],
            "responses": [
                "We provide a range of web services including IT and Cloud Solutions. We understand the business needs and provide right solution for right business in partnership with Microsoft Azure, Google Cloud and Amazon Web Service, HPE. You can get more information about it <a href=\"https://teleaus.com/services?slug=cloud\" target=\"_blank\">here</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "business process outsourcing",
            "patterns": [
                "Is there any option for business process outsourcing?",
                "Does teleaus do outsourcing?",
                "Do they do business process outsourcing?"
            ],
            "responses": [
                "Teleaus has a skilled offshore team to support our valued client in validation, invoicing, payment, accounting and payroll. You can get more information about it <a href=\"https://teleaus.com/services?slug=business-process\" target=\"_blank\">here</a>."
            ],
            "context_set": ""
        },
        {
            "tag": "partners",
            "patterns": [
                "Who are teleaus partners?",
                "who are the partners of teleaus?",
                "who are their main partners?",
                "what is teleaus partner network?"
            ],
            "responses": [
                "In today’s global marketplace, utilizing complementary collaboration is the key to gaining competitive advantage. To that end, we have established long-term strategic alliances and partnerships with the world’s leading technology vendor companies like: Downer, Lendlease, Tesltra Air, Visionstream, UCG, Amazon, Cisco, Aruba Networks, Google, Microsoft, Ericsson, Huawei etc. Our mission is to consult about and deploy the best enterprise solutions to the most perplexing business challenges, leveraging – and often co-developing – the world-class technologies our strategic alliance partners have to offer. We provide custom industry solutions methodology that will help you utilize advanced technology and draw maximum business value from your investments. Through our Partner Network, Partners can reques EOI and connect with other partners around the world."
            ],
            "context_set": ""
        }
    ]
}